# Bar Terminations Data End Treatment Type Id At End Property

Source: https://www.revitapidocs.com/2026/ad9dea2f-1e0b-de28-38f5-e557015a1672.htm

---

| Bar Terminations Data End Treatment Type Id At End Property |
| --- |

Identifies the end treatment type at the end of bar.
 Setting this property to a valid value, will set the CrankTypeIdAtEnd and HookTypeIdAtEnd to ElementId.InvalidElementId.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId EndTreatmentTypeIdAtEnd { get; set; }
```

```
Public Property EndTreatmentTypeIdAtEnd As ElementId
	Get
	Set
```

```
public:
property ElementId^ EndTreatmentTypeIdAtEnd {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member EndTreatmentTypeIdAtEnd : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: endTreatmentTypeIdAtEnd doesn't represent an end treatment type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace